a = int(input())
b = int(input())
n = int(input())
convert = a * 100 + b
totalCost = (convert * n)
print(totalCost // 100, totalCost % 100)

# Пирожок в столовой стоит A рублей и B копеек.
# Определите, сколько рублей и копеек нужно заплатить за N пирожков.
